Hello from xlnet!
XLNetModel(
  (word_embedding): Embedding(32000, 768)
  (layer): ModuleList(
    (0-11): 12 x XLNetLayer(
      (rel_attn): XLNetRelativeAttention(
        (layer_norm): LayerNorm((768,), eps=1e-12, elementwise_affine=True)
        (dropout): Dropout(p=0.1, inplace=False)
      )
      (ff): XLNetFeedForward(
        (layer_norm): LayerNorm((768,), eps=1e-12, elementwise_affine=True)
        (layer_1): Linear(in_features=768, out_features=3072, bias=True)
        (layer_2): Linear(in_features=3072, out_features=768, bias=True)
        (dropout): Dropout(p=0.1, inplace=False)
        (activation_function): GELUActivation()
      )
      (dropout): Dropout(p=0.1, inplace=False)
    )
  )
  (dropout): Dropout(p=0.1, inplace=False)
)
===============================================================================================
Layer (type:depth-idx)                        Output Shape              Param #
===============================================================================================
XLNetModel                                    [128, 1, 768]             768
├─Embedding: 1-1                              [128, 1, 768]             24,576,000
├─Dropout: 1-2                                [128, 1, 768]             --
├─Dropout: 1-3                                [256, 1, 768]             --
├─ModuleList: 1-4                             --                        --
│    └─XLNetLayer: 2-1                        [128, 1, 768]             --
│    │    └─XLNetRelativeAttention: 3-1       [128, 1, 768]             2,954,496
│    │    └─XLNetFeedForward: 3-2             [128, 1, 768]             4,723,968
│    └─XLNetLayer: 2-2                        [128, 1, 768]             --
│    │    └─XLNetRelativeAttention: 3-3       [128, 1, 768]             2,954,496
│    │    └─XLNetFeedForward: 3-4             [128, 1, 768]             4,723,968
│    └─XLNetLayer: 2-3                        [128, 1, 768]             --
│    │    └─XLNetRelativeAttention: 3-5       [128, 1, 768]             2,954,496
│    │    └─XLNetFeedForward: 3-6             [128, 1, 768]             4,723,968
│    └─XLNetLayer: 2-4                        [128, 1, 768]             --
│    │    └─XLNetRelativeAttention: 3-7       [128, 1, 768]             2,954,496
│    │    └─XLNetFeedForward: 3-8             [128, 1, 768]             4,723,968
│    └─XLNetLayer: 2-5                        [128, 1, 768]             --
│    │    └─XLNetRelativeAttention: 3-9       [128, 1, 768]             2,954,496
│    │    └─XLNetFeedForward: 3-10            [128, 1, 768]             4,723,968
│    └─XLNetLayer: 2-6                        [128, 1, 768]             --
│    │    └─XLNetRelativeAttention: 3-11      [128, 1, 768]             2,954,496
│    │    └─XLNetFeedForward: 3-12            [128, 1, 768]             4,723,968
│    └─XLNetLayer: 2-7                        [128, 1, 768]             --
│    │    └─XLNetRelativeAttention: 3-13      [128, 1, 768]             2,954,496
│    │    └─XLNetFeedForward: 3-14            [128, 1, 768]             4,723,968
│    └─XLNetLayer: 2-8                        [128, 1, 768]             --
│    │    └─XLNetRelativeAttention: 3-15      [128, 1, 768]             2,954,496
│    │    └─XLNetFeedForward: 3-16            [128, 1, 768]             4,723,968
│    └─XLNetLayer: 2-9                        [128, 1, 768]             --
│    │    └─XLNetRelativeAttention: 3-17      [128, 1, 768]             2,954,496
│    │    └─XLNetFeedForward: 3-18            [128, 1, 768]             4,723,968
│    └─XLNetLayer: 2-10                       [128, 1, 768]             --
│    │    └─XLNetRelativeAttention: 3-19      [128, 1, 768]             2,954,496
│    │    └─XLNetFeedForward: 3-20            [128, 1, 768]             4,723,968
│    └─XLNetLayer: 2-11                       [128, 1, 768]             --
│    │    └─XLNetRelativeAttention: 3-21      [128, 1, 768]             2,954,496
│    │    └─XLNetFeedForward: 3-22            [128, 1, 768]             4,723,968
│    └─XLNetLayer: 2-12                       [128, 1, 768]             --
│    │    └─XLNetRelativeAttention: 3-23      [128, 1, 768]             2,954,496
│    │    └─XLNetFeedForward: 3-24            [128, 1, 768]             4,723,968
├─Dropout: 1-5                                [128, 1, 768]             --
===============================================================================================
Total params: 116,718,336
Trainable params: 116,718,336
Non-trainable params: 0
Total mult-adds (Units.GIGABYTES): 10.40
===============================================================================================
Input size (MB): 0.00
Forward/backward pass size (MB): 66.85
Params size (MB): 325.13
Estimated Total Size (MB): 391.98
===============================================================================================
